acledsInc/CH32V003_SPWM_DMA-ST7735_SPI_DMA/User/main.c
    // TIM1 CH1 Output =CH1 + CH1N =PD2, PD0
    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;   
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
    TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;

    TIM_OCInitStructure.TIM_Pulse = ccp;  // start duty =50%
    TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low; 
    TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_Low;  
    TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
    TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCNIdleState_Reset;
    TIM_OC1Init(TIM1, &TIM_OCInitStructure);
    TIM_OC2Init(TIM1, &TIM_OCInitStructure);

    // TIM1 BRKIN =PC2, TIM1_Dead_Time
    TIM_BDTRInitStructure.TIM_OSSIState = TIM_OSSIState_Disable;
    TIM_BDTRInitStructure.TIM_OSSRState = TIM_OSSRState_Disable;
    TIM_BDTRInitStructure.TIM_LOCKLevel = TIM_LOCKLevel_OFF;

    TIM_BDTRInitStructure.TIM_DeadTime = 200;   // dead time =20us
    TIM_BDTRInitStructure.TIM_Break = TIM_Break_Enable; // external break =PC2
    TIM_BDTRInitStructure.TIM_BreakPolarity = TIM_BreakPolarity_High;
    TIM_BDTRInitStructure.TIM_AutomaticOutput = TIM_AutomaticOutput_Enable;
    TIM_BDTRConfig(TIM1, &TIM_BDTRInitStructure);

    TIM_CtrlPWMOutputs(TIM1, ENABLE);   // Enable PWM output
    TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Disable);
    TIM_OC2PreloadConfig(TIM1, TIM_OCPreload_Disable);

    TIM_ARRPreloadConfig(TIM1, ENABLE);
    TIM_Cmd(TIM1, ENABLE); //  Start TIM1
}

//--------------------------------------------------------
// TIM1_DMA_Init
// Initializes the TIM DMAy Channelx configuration.
//--------------------------------------------------------
void TIM1_DMA_Init(DMA_Channel_TypeDef *DMA_CHx, u32 ppadr, u32 memadr, u16 bufsize)
{
    DMA_InitTypeDef DMA_InitStructure = {0};
    NVIC_InitTypeDef NVIC_InitStructure = {0};
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

    DMA_DeInit(DMA_CHx);
    DMA_InitStructure.DMA_PeripheralBaseAddr = ppadr;
    DMA_InitStructure.DMA_MemoryBaseAddr = memadr;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
    DMA_InitStructure.DMA_BufferSize = bufsize;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;

    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    //DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;

    DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(DMA_CHx, &DMA_InitStructure);
    DMA_Cmd(DMA_CHx, ENABLE);

    NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel5_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    DMA_ITConfig(DMA1_Channel5, DMA_IT_TC, ENABLE );
}

//--------------------------------------------------------
// interrupt for End of DMA Transfer
//--------------------------------------------------------
void DMA1_Channel5_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void DMA1_Channel5_IRQHandler(void)
{
    if(DMA_GetITStatus(DMA1_IT_TC5) != RESET )
    {
        if (GPIO_ReadOutputDataBit(GPIOC, DMA_LED) ==SET)
        {
            GPIO_ResetBits(GPIOC, DMA_LED);  // DMA LED off

            // 180~360deg Sine PWM by Sine Table
            TIM1_DMA_Init(DMA1_Channel5, (u32)TIM1_CH2CVR_ADDRESS, (u32)sine_fdb, buf_size);
        }

        else
        {
            GPIO_SetBits(GPIOC, DMA_LED);   // DMA LED on

            // 0~180deg Sine PWM by Sine Table
            TIM1_DMA_Init(DMA1_Channel5, (u32)TIM1_CH1CVR_ADDRESS, (u32)sine_fdb, buf_size);
        }
        DMA_ClearITPendingBit(DMA1_IT_TC5);
    }
}

//--------------------------------------------------------
// TIM2_INT_Init(USER_DELAY -1, 48 -1);
// TIM2 Clock =1us
//--------------------------------------------------------
void TIM2_INT_Init(u32 arr, u16 psc)
{
    TIM_TimeBaseInitTypeDef TIMBase_InitStruct;
    NVIC_InitTypeDef NVIC_InitStruct;

    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

    TIM_DeInit(TIM2);
    TIMBase_InitStruct.TIM_Period = arr;
    TIMBase_InitStruct.TIM_CounterMode = TIM_CounterMode_Up;
    TIMBase_InitStruct.TIM_Prescaler = psc;
    TIMBase_InitStruct.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInit(TIM2, &TIMBase_InitStruct);
    TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);

    NVIC_InitStruct.NVIC_IRQChannel = TIM2_IRQn;
    NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 5;
    NVIC_InitStruct.NVIC_IRQChannelSubPriority = 5;
    NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStruct);
    //TIM_Cmd(TIM2, ENABLE);  //  Start TIM2
}

// TIM1_IRQHandler handles of TIM1 interrupt
void TIM1_UP_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void TIM1_UP_IRQHandler(void)
{
   if( TIM_GetITStatus(TIM1, TIM_IT_Update ) ==SET)
   {
       //printf( "TIM1\r\n" );
   }
   // Clear TIM1 flag
   TIM_ClearITPendingBit(TIM1, TIM_IT_Update );
}

// TIM2_IRQHandler handles of TIM2 interrupt
// Interrupt flag is set
u8 timer2_flag =0;

void TIM2_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void TIM2_IRQHandler(void)
{
   if (TIM_GetITStatus(TIM2, TIM_IT_Update) ==SET)
   {
       TIM_Cmd(TIM2, DISABLE);  // Stop TIM2

       // this can be replaced with your code of flag set
       // so that in main's that flag can be handled
       timer2_flag =1;  // end of timer2

       // Clear TIM2 flag
       TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
   }
}

//---------------------------------------------------------------------
// init SPWM waveform
// SPWM table -> DMA1-CH5 -> TIM1-CCP -> SPWM output
// DMA1_Channel5_IRQHandler -> Switch transfer to CCP1 or CCCP2
//---------------------------------------------------------------------
void init_SPWM(void)
{
    // (psc, arr*2 , ccr) for 15.0KHz PWM / 120 Step =120Hz
    TIM1_PWMOut_Init(TIM1_ARR, TIM1_PSC -1, 0);

