acledsInc/CH32V003_SPWM_DMA-ST7735_SPI_DMA/User/main.c
//---------------------------------------------------------------------
// ST7735 demo display
//---------------------------------------------------------------------
void demo_LCD(void)
{
    random_dot();

    scan_hline();
    scan_vline();
    random_line();

    center_rect();
    random_rect();

    fill_rect();
    move_rect();
}

//---------------------------------------------------------------------
// Init AD7 =PD4
//---------------------------------------------------------------------
#include "ch32v00x_adc.h"
#include <stdio.h>

u16 bin_val;
float fdb_val;
char disp_str[5];

void init_ADC(void)
{
    GPIO_InitTypeDef GPIO_InitStructure = {0};
    ADC_InitTypeDef  ADC_InitStructure = {0};

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
    RCC_ADCCLKConfig(RCC_PCLK2_Div8);

    // AD7 =PD4
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_Init(GPIOD, &GPIO_InitStructure);

    ADC_DeInit(ADC1);
    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
    ADC_InitStructure.ADC_ScanConvMode = DISABLE;
    ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfChannel = 1;
    ADC_Init(ADC1, &ADC_InitStructure);

    ADC_DMACmd(ADC1, ENABLE);
    ADC_Cmd(ADC1, ENABLE);

    //ADC_BufferCmd(ADC1, DISABLE);    //disable buffer
    ADC_RegularChannelConfig(ADC1, ADC_Channel_7, 1, ADC_SampleTime_30Cycles);
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);
    Delay_Ms(50);
    //ADC_SoftwareStartConvCmd(ADC1, DISABLE);
}

u16 read_ADC(void)
{
    u16 val;    // result of ADC_Channel_7

    ADC_RegularChannelConfig(ADC1, ADC_Channel_7, 1, ADC_SampleTime_30Cycles);
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);

    while(!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC));
    val = ADC_GetConversionValue(ADC1);
    return val;
}

void disp_ADC(void)
{
    bin_val =read_ADC();
    fdb_val =(float)(bin_val);

    tft_set_color(GREEN);
    tft_set_cursor(0, 88);
    tft_print("ADC-CH7: ");

    // binary convert to decimal as right align
    sprintf(disp_str, "%4d", bin_val);
    tft_set_color(YELLOW);
    tft_set_cursor(54, 88);
    tft_print(disp_str);
}

u32 timer2_cnt =0;
void disp_TIM2(void)
{
    tft_set_color(GREEN);
    tft_set_cursor(0, 98);
    tft_print("TIM2-CNT: ");

    timer2_cnt = TIM2->CNT;
    sprintf(disp_str, "%4d", timer2_cnt);
    tft_set_color(CYAN);
    tft_set_cursor(54, 98);
    tft_print(disp_str);
}

void disp_MENU(void)
{
    tft_fill_rect(0, 0, ST7735_WIDTH, ST7735_HEIGHT, BLACK);
    tft_set_background_color(BLACK);
    tft_set_color(GREEN);
    tft_set_cursor(0, 1);
    tft_print("CH32V003 ST7735 Demo");

    tft_set_color(WHITE);
    tft_set_cursor(0, 16);
    tft_print("1. Random dot");
    tft_set_cursor(0, 24);
    tft_print("2. Horizon line");
    tft_set_cursor(0, 32);
    tft_print("3. Vertical line");
    tft_set_cursor(0, 40);
    tft_print("4. Random line");
    tft_set_cursor(0, 48);
    tft_print("5. Center Rectangle");
    tft_set_cursor(0, 56);
    tft_print("6. Random Rectangle");
    tft_set_cursor(0, 64);
    tft_print("7. Fill rectangle");
    tft_set_cursor(0, 72);
    tft_print("8. Move Rectangle");
}

//---------------------------------------------------------------------
// Main program.
//---------------------------------------------------------------------
int main(void)
{
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
    SystemCoreClockUpdate();    // HSI 48MHz
    Delay_Init();

    // all clear AF of GPIO
    GPIO_AFIODeInit();

#if (SDI_PRINT == SDI_PR_OPEN)
    SDI_Printf_Enable();
#else
    USART_Printf_Init(115200);
#endif
    //printf("SystemClk:%d\r\n", SystemCoreClock);
    //printf("ChipID:%08x\r\n", DBGMCU_GetCHIPID() );

    init_SPWM();

    // Init ST7735 TFT LCD
    tft_init();
    Delay_Ms(100);

    // clear screen
    tft_fill_rect(0, 0, ST7735_WIDTH, ST7735_HEIGHT, BLACK);
    // set text color
    tft_set_color(WHITE);
    // set text bg color
    tft_set_background_color(BLACK);

    //demo_LCD();
    disp_MENU();
    init_ADC();

    // user interval timer =TIM2 clock =1ms
    TIM2_INT_Init(9999, 48000 -1);   // ARR =10,000ms

    // End of Hardware Setup
    while(1)
    {
        // start user code
        TIM_Cmd(TIM2, ENABLE);
        timer2_flag =0; // reset timer2 flag

        while(timer2_flag == 0)
        {
            disp_ADC();     // read ADC and Display
            disp_TIM2();    // display timer2

            Delay_Ms(10);   // Display time
        }

        demo_LCD();
        disp_MENU();
        // end user code
    }
}   // End of main()
//---------------------------------------------------------------------

